def int_func(word):
    """
    Принимает слово. Делает проверку что все буквы латинские в нижнем регистре.
    При прохождении проверки возвращает слово с первой буквой в верхнем регистре.
    При не прохождении проверки возвращает исходное слово и сообщение об ошибке.

    """
    for i in word:
        if ord(i) < 97 or ord(i) > 122:
            print('Ошибка. Принимаются только латинские буквы в нижнем регистре!')
            return word
        else:
            return word.capitalize()


new_word_str = []
word_str = input(
    'Введите строку из слов, разделенных пробелом. Каждое слово состоит из латинских букв в нижнем регистре: ')

for i in word_str.split():
    new_word_str.append(int_func(i))

print(' '.join(new_word_str))
